[
  {
    "name": "Los Nardos",
    "region": "andalucia",
    "description": "Los Nardos Beach, adorned with the Blue Flag, is a medium-sized coastal gem where rocks, gravel, and sand intermingle, offering a tranquil escape from tourist crowds. Stretching 500 meters in length and 20 meters in width, it is nestled in a dune environment, featuring a blend of sandy shores, pebbles, rocks, and gravel. With moderate waves, this secluded beach maintains a low occupancy level, providing an isolated and natural setting for those seeking a peaceful coastal retreat.",
    "location": [
      37.335424349813806,
      -1.6911077967656016
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "surf",
      "nudism",
      "diving",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/6/2/9/4erjey4yokrf3vfqsjmzbehnom_1000.webp"
  },
  {
    "name": "Zahara de los Atunes",
    "region": "andalucia",
    "description": "Zahara de los Atunes Beach proudly flies the Blue Flag, spanning from Zahara to Cape Plata and named after the charming La Atlanterra development. With a generous length of 1600 meters and a width of 70 meters, this urban beach boasts fine golden sand. Conditions for swimming include moderate waves and occasional gusts, while its semi-urban setting provides a lively atmosphere with high occupancy. Not designated as a nudist beach, Zahara de los Atunes offers a vibrant coastal experience for beachgoers.",
    "location": [
      36.142584007579366,
      -5.856611155600397
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "surf",
      "diving"
    ],
    "beachPic": "https://upload.wikimedia.org/wikipedia/commons/8/85/Zahara_de_los_Atunes_vista_desde_el_cielo.jpg"
  },
  {
    "name": "La Breña",
    "region": "andalucia",
    "description": "Playa La Breña, located 24 km from Córdoba, proudly boasts the Blue Flag, ensuring quality and safety. Stretching 140 meters, it resides in a picturesque reservoir setting, providing a peaceful retreat. With its soft sandy composition, this beach offers a serene and accessible destination to enjoy nature.",
    "location": [
      37.84010388081578,
      -5.048525556830541
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "diving",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/6/2/0/zsjaaiiul7h7pjvagqfjwtzysq_1000.webp"
  },
  {
    "name": "La Herradura",
    "region": "andalucia",
    "description": "La Herradura Beach, proudly flying the Blue Flag, is a family-friendly urban oasis known for its excellent amenities and high-quality services. Spanning 2050 meters in length and 40 meters in width, this beach features a blend of sandy shores and gravel, providing a well-equipped and accessible environment. Awarded the Q for Touristic Quality since 2012, it boasts tranquil waters, a bustling atmosphere with high occupancy, and urban surroundings, complemented by a scenic seaside promenade.",
    "location": [
      36.7321128452201,
      -3.7394750337416505
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "nudism",
      "diving"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/4/0/7/opro6tgfxwgs26mirp4jsjsigi_1000.webp"
  },
  {
    "name": "El Espigón Juan Carlos I",
    "region": "andalucia",
    "description": "El Espigón Juan Carlos I Beach, proudly displaying the Blue Flag, rests against the Juan Carlos I dike in the port of Huelva. It is seamlessly integrated into the Natural Site of Marismas del Odiel. This isolated beach spans an impressive 3000 meters in length and 150 meters in width, featuring a backdrop of dunes and a sandy composition. With moderate waves and low occupancy, El Espigón Juan Carlos I Beach provides a serene coastal experience in a protected area, designated as a Natural Site with abundant vegetation.",
    "location": [
      37.14674877306628,
      -6.895377664016804
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "surf",
      "diving",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/5/4/6/rfjyshrn4myeg5gtv4s2fshfyi_1000.webp"
  },
  {
    "name": "Playazo - Chucho",
    "region": "andalucia",
    "description": "Playazo de Rodalquilar, nestled in the Almería desert, is a pristine sandy beach accessed via a dirt road near the town of Rodalquilar. Spanning 400 meters in length and 100 meters in width, this oasis lies within the Cabo de Gata-Níjar Maritime-Terrestrial Natural Park, recently designated as a Biosphere Reserve. Surrounded by mountains, the beach offers tranquil waters, a low level of occupancy, and an isolated, unspoiled environment for a serene coastal experience.",
    "location": [
      36.741737847854914,
      -3.885527273605506
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "surf",
      "diving"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/9/1/1/4vjljlrhmeadcp7t2a6xdihleu_1000.webp"
  },
  {
    "name": "La Ñora",
    "region": "asturias",
    "description": "La Ñora Beach, proudly displaying the Blue Flag, is a small sandy haven bordered by cliffs on one side. With dimensions of 250 meters in length and 70 meters in width, it is nestled in a mountainous environment, offering moderate services and experiencing high occupancy. Notable for a seaside promenade leading to a cliffside viewpoint, the beach provides a semi-urban setting with strong waves for those seeking a dynamic coastal experience. Situated in a protected area designated as a Site of Community Importance (LIC), it features lush vegetation, adding to its environmental appeal.",
    "location": [
      43.54782857624094,
      -5.590747534654813
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "nudism",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/9/5/6/gg7fi4qnuk57t5sp7avuupmswi_1000.webp"
  },
  {
    "name": "Cala Llenya",
    "region": "baleares",
    "description": "Cala Llenya Beach, adorned with the Blue Flag, is a sandy shoreline popular among local tourists. Stretching 220 meters in length and 80 meters in width, it is situated in a semi-urban environment, offering a serene coastal retreat. With calm waters, moderate occupancy, and an isolated urbanization level, Cala Llenya provides a peaceful and accessible beach experience in its scenic surroundings.",
    "location": [
      39.01546560548206,
      1.584619422072437
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "diving",
      "kayak"
    ],
    "beachPic": "https://playasbaleares.s3.fr-par.scw.cloud/2020/05/calallenya5-1024x575.jpg"
  },
  {
    "name": "S'Amarador",
    "region": "baleares",
    "description": "S'Amarador Beach, proudly flying the Blue Flag, is nestled within the Mondragó Natural Park, surrounded by lush vegetation and popular among tourists. Accessible through a trail, this isolated beach spans 145 meters in length and 50 meters in width, featuring dunes and fine sandy shores. With calm waters and a high level of occupancy, S'Amarador offers a tranquil coastal retreat in a protected area designated as an ANEI (Área Natural de Especial Interés) and a Natural Park, showcasing abundant vegetation.",
    "location": [
      39.349990942929686,
      3.18561347685988
    ],
    "difficultyAccess": "medium",
    "entertainment": [
      "nudism",
      "diving",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/2/3/1/yh46jrtyamjm4pv4lv3jqktmya_1000.webp"
  },
  {
    "name": "Son Bou",
    "region": "baleares",
    "description": "Son Bou Beach, boasting the Blue Flag, stands as one of the most frequented beaches in the southern part of the island. Renowned for its quality sand, expansive shoreline, diverse tourist offerings, and excellent amenities, it caters to a wide range of visitors. With a length of 2300 meters and a width of 40 meters, this semi-urban gem features tranquil waters, high occupancy, and semi-urban development, while actively preserving and regenerating its dune area. The beach offers environmental protection, including marked swimming zones, beach volleyball facilities, and free-to-use picnic tables, all contributing to a well-equipped and ecologically conscious coastal destination.",
    "location": [
      39.89901816862351,
      4.077354764113588
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "surf",
      "diving",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/6/2/8/gjjfzce45q5jecelpcvflgm5wa_1000.webp"
  },
  {
    "name": "El Matorral",
    "region": "canarias",
    "description": "El Matorral Beach, located in Puerto del Rosario, is a 200-meter stretch of sandy coastline. Situated in an airport area, this beach offers a unique setting with a length of 200 meters and a width of 15 meters. Surrounded by dunes and featuring a composition of pebbles and rocks, it presents a tranquil atmosphere with moderate waves. Despite its proximity to the airport, the beach maintains a low level of occupancy, providing an isolated and secluded experience for beachgoers.",
    "location": [
      28.04505150706205,
      -14.3353515172108
    ],
    "difficultyAccess": "high",
    "entertainment": [
      "nudism",
      "diving"
    ],
    "beachPic": "https://www.ifuerteventura.net/media/header/playa-del-matorral.webp"
  },
  {
    "name": "Los Charcones",
    "region": "canarias",
    "description": "Los Charcones Beach, adorned with the Blue Flag, is located near Puertillo de San Andrés in Arucas and spans 175 meters, featuring a mix of sand, gravel, and pebbles. Comprising natural pool bathing areas, this semi-urban beach offers a delightful retreat for visitors, inviting them to enjoy a wonderful day by the pools. The extensive sunbathing areas add to the appeal, providing a perfect spot for relaxation. Accessible by bus, the coastal area boasts a seaside promenade stretching from El Puertillo, enhancing the overall experience of this semi-urban gem with high occupancy and strong waves.",
    "location": [
      28.17173285064391,
      -15.53951932834938
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "diving",
      "kayak"
    ],
    "beachPic": "https://ociolanzarote.com/wp-content/imagenes/piscina-natural-tranquila.jpg"
  },
  {
    "name": "Matagorda",
    "region": "canarias",
    "description": "Matagorda Beach, proudly displaying the Blue Flag, is situated in Tías and spans 840 meters of sandy shoreline. With a width of 40 meters, this urban beach offers tranquil waters, albeit occasionally breezy conditions. Boasting a high level of occupancy, it provides an urbanized setting with a seaside promenade, creating a vibrant atmosphere for beachgoers. Matagorda Beach is a popular destination for those seeking a lively coastal experience in Tías.",
    "location": [
      28.92770521562338,
      -13.627050175359189
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "surf",
      "nudism",
      "diving"
    ],
    "beachPic": "https://turismolanzarote.com/wp-content/uploads/2017/03/MG_7859.jpg"
  },
  {
    "name": "La Cueva",
    "region": "canarias",
    "description": "La Cueva Beach, adorned with the Blue Flag, is a black sand beach located near the port of San Sebastián de la Gomera, offering visitors a variety of amenities. Spanning 350 meters in length and 60 meters in width, this semi-urban beach boasts a sandy composition and tranquil waters. With a moderate level of occupancy and urbanization, La Cueva Beach features a seaside promenade, providing a pleasant coastal experience. Notably, it is situated in a protected area within the Biosphere Reserve, surrounded by lush vegetation.",
    "location": [
      28.30328808625781,
      -13.903219342941519
    ],
    "difficultyAccess": "medium",
    "entertainment": [
      "diving",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/0/2/9/qvgaon2htw37amls6c2iaeo4vm_500.webp"
  },
  {
    "name": "Timijiraque",
    "region": "canarias",
    "description": "Timijiraque Beach, proudly flying the Blue Flag, is located near the Puerto de la Estaca and stands out as one of the few sandy beaches on the island. Spanning 350 meters in length and 20 meters in width, this semi-urban gem is a magnet for surfers, attracting those seeking moderate waves. With a moderate level of occupancy and semi-urban development, the beach features a seaside promenade, creating a pleasant atmosphere for visitors. Noteworthy for its environmental significance, Timijiraque Beach is situated in a protected area, encompassing various designations such as LIC (Site of Community Importance), ZEC (Special Conservation Area), natural habitats of Community Interest, a Protected Landscape, and a Biosphere Reserve, adorned with lush vegetation.",
    "location": [
      27.77012150087426,
      -17.914692202478456
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "diving",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/0/9/2/54nm3xh6ustjp4vi4iq6tt3wty_1000.webp"
  },
  {
    "name": "Charco Verde",
    "region": "canarias",
    "description": "Charco Verde Beach, proudly awarded the Blue Flag, is easily accessible and popular, offering convenient parking facilities. Spanning 271 meters in length and 48 meters in width, this beach, situated in a cliffside environment, provides a moderate wave experience. Despite its moderate level of occupancy, the beach maintains an isolated feel, complemented by a seaside promenade. Recognized for its environmental importance, El Charco Verde is located in a protected area, designated both as a Protected Landscape and a Biosphere Reserve, ensuring a harmonious blend of natural beauty and accessibility for visitors.",
    "location": [
      28.572599814247546,
      -17.89931749188581
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "surf",
      "diving",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/4/9/4/yuxjotzvuboj7rwo7oy55sleea_1000.webp"
  },
  {
    "name": "Playa de la Jaquita",
    "region": "canarias",
    "description": "La Jaquita Beach, proudly adorned with the Blue Flag, is a collection of small coves and natural pools tailored for bathing enjoyment. Spanning 205 meters in length and 33 meters in width, this semi-urban gem features a mix of sand and gravel, offering tranquil waters for a relaxed beach experience. With a moderate level of occupancy and a semi-urbanized setting, the beach includes a seaside promenade for leisurely strolls. Embraced by protected areas, La Jaquita is not only recognized for its environmental significance but also features natural habitats of community interest, ensuring a harmonious blend of coastal beauty and ecological preservation.",
    "location": [
      28.05058416720426,
      -16.530239562807203
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "diving"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/7/8/5/nmaxe7xyukk33cv7v5t5gml2nq_1000.webp"
  },
  {
    "name": "El Sable de Tagle",
    "region": "cantabria",
    "description": "El Sable de Tagle Beach, proudly bearing the Blue Flag, is a small sandy enclave offering diverse services. With a length of 200 meters and a width of 50 meters, this beach is nestled in a mountainous setting, providing a unique coastal experience. Despite its moderate level of occupancy, El Sable maintains an isolated feel, complemented by its environmental richness, including lush vegetation. Services such as beachside restrooms and seasonal bus access add convenience to this secluded and environmentally vibrant coastal retreat.",
    "location": [
      43.42780514628876,
      -4.093531610690207
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "surf",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/5/1/2/kl2ztrutodj6ih5am43g64r6za_1000.webp"
  },
  {
    "name": "Llarga",
    "region": "cataluña",
    "description": "Llarga Beach, adorned with the Blue Flag, is a crescent-shaped enclave with small stone breakwaters and excellent golden sand. Spanning 700 meters in length and 40 meters in width, this urban beach is situated between the municipalities of Cubelles and the Sant Gervasi beach. Equipped with amphibious chairs and adapted restrooms, it uniquely combines natural beauty with urban conveniences. Sixty percent of the beach is a protected natural space, marked and preserved, while the remaining 40% features a semi-urban landscape with a lively atmosphere, a seaside promenade, and lush vegetation, making it an ideal destination for beach enthusiasts.",
    "location": [
      41.13004792388411,
      1.3068505039729263
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "diving",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/1/5/0/l4o4lpvjslbplslkfhqmwm5vey_1000.webp"
  },
  {
    "name": "La Mar Menuda",
    "region": "cataluña",
    "description": "La Mar Menuda proudly flying the Blue Flag, is a semi-urban coastal haven with a length of 180 meters and a width of 20 meters. Boasting golden, coarse-textured sand, it offers a comprehensive range of services typical of urban beaches, along with a vibrant selection of nautical and sports rentals. At one end, you'll find the Banyera de Ses Dones, a sandy area protected by rocks, popular among families and equipped with an amphibious chair. With moderate waves and a high level of occupancy, this urbanized beach features a seaside promenade, making it a dynamic and well-equipped destination for beachgoers.",
    "location": [
      41.722408934225015,
      2.93827090779915
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "nudism",
      "diving"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/3/5/8/adp4xmkc36yrw7bxiemse6y4dm_1000.webp"
  },
  {
    "name": "Les Avellanes",
    "region": "cataluña",
    "description": "Les Avellanes proudly awarded the Blue Flag, is a small urban enclave with a length of 170 meters and a width of 32 meters. Noted for its fine sand and tranquil waters, this beach is situated in the town center. Despite its modest size, it boasts a high level of occupancy, creating a lively atmosphere for beachgoers. With an urbanized setting and a seaside promenade, Les Avellanes offers a well-equipped and vibrant coastal experience in a convenient urban location.",
    "location": [
      40.812348018586704,
      0.7142341093513325
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "surf",
      "nudism",
      "diving",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/6/0/6/ugt43v4tqxooucb7omx4vsgv4i_1000.webp"
  },
  {
    "name": "Mil Palmeras",
    "region": "comunidad valenciana",
    "description": "Mil Palmeras proudly displaying the Blue Flag, is a natural coastal gem situated in an urban area, offering a full range of essential services. Honored with the Q for Touristic Quality in 2014, this 130-meter-long and 45-meter-wide beach provides calm waters and a sandy composition. Despite its urban surroundings, it maintains a natural ambiance, complemented by safety measures and services during peak seasons. The presence of vegetation enhances the environmental appeal, making Mil Palmeras / Vistamar a bustling yet environmentally conscious urban beach with a seaside promenade.",
    "location": [
      37.88186981210894,
      -0.7538246320995559
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "diving",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/3/3/1/qo7t7io5rcyqxkjabcwrri4zdi_1000.webp"
  },
  {
    "name": "El Moro",
    "region": "comunidad valenciana",
    "description": "Cala del Moro is a small cove without services or suitable facilities for use, but it is suitable for swimming. Spanning 40 meters in length and 10 meters in width, this urban beach is nestled in a mountainous environment, featuring a mix of sand and gravel. With moderate waves and a medium level of occupancy, Cala del Moro maintains an urbanized setting. Notably, it is situated in a protected area and designated as part of a Natural Park, offering a secluded and environmentally rich coastal experience.",
    "location": [
      28.687611314108032,
      -13.832153751153214
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "nudism",
      "diving",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/7/6/6/3d4ta45fkuxkhajeda62piovwe_1000.webp"
  },
  {
    "name": "L'Aigua Morta",
    "region": "comunidad valenciana",
    "description": "L'Aigua Morta Beach, proudly boasting the Blue Flag, is a semi-natural haven with excellent services, including camping areas. Honored with the Q for Touristic Quality in 2014, this beach spans an impressive 2000 meters in length and 50 meters in width. Situated in a semi-urban and dune-rich environment, it features tranquil waters and occasionally breezy conditions. With a moderate level of occupancy, this semi-urbanized gem is designated as a protected area, part of the LIC (Site of Community Importance) Dunas de la Safor, showcasing lush vegetation. L'Aigua Morta offers a harmonious blend of environmental richness and visitor amenities for a well-rounded coastal experience.",
    "location": [
      38.903624128809106,
      -0.060494900736654644
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "surf",
      "nudism",
      "diving"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/2/0/9/rspjdofxgy4izfvyq2cdfh3kba_1000.webp"
  },
  {
    "name": "La Dehesa",
    "region": "extremadura",
    "description": "La Dehesa Beach, adorned with the Blue Flag, is an inland gem nestled within the Alqueva reservoir on the Guadiana River. Providing a unique experience, it offers panoramic views of Portuguese landscapes. With a fluvial environment and sandy composition, this beach boasts a wide range of services, water activities, and recreational areas, making it a versatile destination for both relaxation and adventure.",
    "location": [
      38.55266254420337,
      -7.289879166584088
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "nudism",
      "diving"
    ],
    "beachPic": "https://www.turismoextremadura.com/viajar/shared/galerias/rrtt/zonas-banno/zona-banno_00032/img/A_PLAYA_CHELES_04.jpg"
  },
  {
    "name": "As Lapas",
    "region": "galicia",
    "description": "As Lapas Beach proudly flying the Blue Flag, is a small sandy enclave in excellent conservation. Spanning 70 meters in length and 30 meters in width, this beach is situated in a cliffside environment. Accessible by foot and in good condition, it offers tranquil waters and moderate waves for a relaxed beach experience. With a high level of occupancy and an urbanized setting complemented by a seaside promenade, As Lapas features lush vegetation, creating a vibrant coastal atmosphere.",
    "location": [
      43.383878222485336,
      -8.405980369309626
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "surf",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/2/9/4/ipdkh2rmv2kbjwhpyatcuqi3uq_1000.webp"
  },
  {
    "name": "A Rapadoira",
    "region": "galicia",
    "description": "A Rapadoira Beach, adorned with the Blue Flag, is a bustling urban beach located in the heart of Foz, known for its family-friendly services and features. Recognized with the Q for Touristic Quality and ISO14001 and EMAS certifications, this extensive white sandy beach spans 270 meters in length and varies in width from 300 to 365 meters. With a high level of occupancy and comprehensive amenities, it offers adapted infrastructure, including an amphibious chair and assisted bathing. Sporting a seaside promenade, A Rapadoira Beach is a vibrant, protected urban area, part of the ZEPA (Special Protection Areas for Birds), featuring lush vegetation and hosting sports activities during the summer season.",
    "location": [
      43.57146641072773,
      -7.248411949240528
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "diving",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/3/9/8/bf72qeqcpqkk4gwsbat2r3fb6e_1000.webp"
  },
  {
    "name": "Areas Gordas",
    "region": "galicia",
    "description": "Areas Gordas Beach, proudly displaying the Blue Flag, is a rustic coastal retreat separated from its similar neighbor by a rocky promontory known as Punta Lapa. With a moderate level of occupancy, this semi-urban beach spans 300 meters in length and varies in width between 20 and 40 meters. Featuring sandy shores and occasionally windy conditions, it is buoyed in the summer. Nestled in a protected area, it is part of the Natura 2000 network, designated as LIC (Site of Community Importance), and recognized as a ZEPA (Special Protection Area for Birds). Adorned with vegetation, Areas Gordas offers a semi-urbanized coastal experience with environmental significance.",
    "location": [
      42.43107274562778,
      -8.872965089823023
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "nudism",
      "diving",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/5/4/0/5vssvzgt2tjt3aaa2urze5axwa_1000.webp"
  },
  {
    "name": "Virgen de la Nueva",
    "region": "comunidad de madrid",
    "description": "Virgen de la Nueva Beach, proudly bearing the Blue Flag, is situated in the San Juan Reservoir, approximately 50 km from the capital. It is divided into two areas, one for swimming and another for watercraft. During the peak season, the beach attracts a significant number of visitors. The reservoir offers opportunities for water activities such as canoeing and kayaking, while the surrounding area provides options for hiking and climbing. Restaurants and picnic areas are available, providing an ideal setting to enjoy a meal amidst the natural beauty of the beach, characterized by a reservoir environment with a mix of sand and grass.",
    "location": [
      40.40617004814782,
      -4.3823666423274075
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "surf",
      "nudism",
      "diving",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/6/2/5/g3p2uy4yrixwcv3oce2e26j6ne_1000.webp"
  },
  {
    "name": "Del Mojón",
    "region": "region de murcia",
    "description": "Del Mojón Beach, a semi-urban enclave near the Cabeza del Mojón rock, boasts a low level of occupancy and lacks services. Spanning 100 meters in length and 22 meters in width, this beach features a composition of large stones (bolos) and is known for its moderate waves. With a semi-urbanized setting and the presence of vegetation, Del Mojón offers a tranquil coastal experience, providing a serene escape without the typical amenities found in more developed beaches.",
    "location": [
      37.57634654731207,
      -1.2272949299672946
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "diving",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/9/0/6/5odm7w2yflsoul7ccgv2f2r5qu_1000.webp"
  },
  {
    "name": "Salurriaga",
    "region": "pais vasco",
    "description": "Salurriaga Beach adorned with the Blue Flag, is one of the pristine beaches within Garaio Park, totaling nearly 3 km in length. Nestled along the reservoir, this beach is surrounded by wooded areas and recreational spaces, providing a serene and scenic environment. Stretching over 2600 meters, Salurriaga Beach features a composition of gravel, offering a unique lakeside experience within the park.",
    "location": [
      42.90669758973986,
      -2.546965442682361
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "nudism",
      "diving"
    ],
    "beachPic": "https://saposyprincesas.elmundo.es/wp-content/uploads/2021/07/playa-de-salurriaga-en-elburgo-alava.jpg"
  },
  {
    "name": "Bakio",
    "region": "pais vasco",
    "description": "Bakio Beach proudly displaying the Blue Flag, is an urban coastal haven with a high level of occupancy and a delightful seaside promenade. As the longest urban and sports-oriented beach in Vizcaya, spanning 982 meters in length and varying between 35 and 130 meters in width, it holds the EMAS environmental certification. With a sandy composition and moderate waves, Bakio Beach offers a vibrant urbanized setting. Notably, a path from the right bank of the beach leads to the protected area of San Juan de Gaztelugatze, adding a touch of natural beauty to the lively coastal scene.",
    "location": [
      43.43017974247647,
      -2.8068375604337823
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "surf",
      "diving",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/8/9/4/3iif2t56vlckezaqtmjjhhzb2y_1000.webp"
  },
  {
    "name": "Chorrillo",
    "region": "ciudad autonoma de ceuta",
    "description": "l Chorrillo Beach, adorned with the Blue Flag, extends along the southern edge of the city, divided by breakwaters, and borders the monumental area, featuring the moat and one of its walls. Situated close to the beach are the renowned bonitos and volaores of Ceuta. Awarded the Q for Touristic Quality in 2014, this urban beach spans 850 meters in length and 30 meters in width, showcasing tranquil waters. With a high level of occupancy and an urbanized environment complemented by a seaside promenade, El Chorrillo Beach offers a picturesque coastal experience in proximity to Ceuta's historic sites and unique marine life.",
    "location": [
      35.886325710185936,
      -5.3212520781470065
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "diving",
      "kayak"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/6/1/4/fcwhgv2fr2b2rl2bipdbfkw6l4_1000.webp"
  },
  {
    "name": "Los Galápagos",
    "region": "ciudad autonoma de melilla",
    "description": "Los Galápagos Beach, distinguished with the Blue Flag, is nestled beneath majestic cliffs. With a length of 200 meters and a width of 30 meters, this coastal gem is surrounded by dramatic cliffs. The beach features sandy shores and is characterized by moderate waves, offering a picturesque setting. Despite being urbanized, Los Galápagos maintains a moderate level of occupancy, providing a serene escape with a touch of natural beauty along the cliffs.",
    "location": [
      35.29494457928063,
      -2.934793122030833
    ],
    "difficultyAccess": "low",
    "entertainment": [
      "nudism",
      "diving"
    ],
    "beachPic": "https://www.inspain.org/imgwbp/playas/8/2/3/alm32x3q7d72lneutzflm7rcum_1000.webp"
  }
]